#+Title: Comandos do android
#+Subtitle: Como verificar se os comandos do android estao no path da sua m√°quina

#+INCLUDE: android_setup_env.org

** Conhecendo a estrutura do nosso projeto
   Entrando no diret√≥rio do projeto e listando o seu conte√∫do,
   conforme comandos abaixo, podemos conhecer a estrutura do nosso projeto.
   #+NAME  
   #+BEGIN_SRC sh :session s1 :results output :exports both  
     cd $ANDROID_STUDIO_PROJECTS_DIR
     ls -l CmdProj
  #+END_SRC

  #+RESULTS:
  #+begin_example

  total 40
  -rw-rw-r--. 1 wagner wagner  942 jan 30 19:56 build.gradle
  -rw-rw-r--. 1 wagner wagner  606 jan 31 11:22 CmdProj.iml
  drwxrwxr-x. 3 wagner wagner 4096 jan 30 17:45 gradle
  -rw-rw-r--. 1 wagner wagner   56 jan 31 22:02 gradle.properties
  -rwxrwxr-x. 1 wagner wagner 5305 jan 30 17:45 gradlew
  -rw-rw-r--. 1 wagner wagner 2269 jan 30 17:45 gradlew.bat
  -rw-rw-r--. 1 wagner wagner  349 jan 31 11:22 local.properties
  -rw-rw-r--. 1 wagner wagner  355 jan 30 19:56 settings.gradle
  drwxrwxr-x. 4 wagner wagner 4096 jan 30 19:56 src
  #+end_example

  Esses s√£o os diret√≥rios do nosso projeto
  + build.gradle
    
  + gradle

  + gradle.properties

  + gradlew

  + gradlew.bat

  + settings.gradle

  + src
    
** [#B] Estrutura de um projeto criado no Android Studio  
   
   #+NAME estrut proj criado no Android Studio                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $ANDROID_STUDIO_PROJECTS_DIR
      ls -l MyApplication
   #+END_SRC

   #+RESULTS:
   #+begin_example

   [wagner@Unknown AndroidStudioProjects]$ total 44
   drwxrwxr-x. 5 wagner wagner 4096 jan  9 23:14 app
   drwxrwxr-x. 3 wagner wagner 4096 jan  9 22:53 build
   -rw-rw-r--. 1 wagner wagner  644 jan  5 22:49 build.gradle
   drwxrwxr-x. 3 wagner wagner 4096 jan  5 22:49 gradle
   -rw-rw-r--. 1 wagner wagner  817 jan  5 23:18 gradle.properties
   -rwxrw-r--. 1 wagner wagner 5296 jan  5 22:49 gradlew
   -rw-rw-r--. 1 wagner wagner 2260 jan  5 22:49 gradlew.bat
   -rw-rw-r--. 1 wagner wagner  437 jan  5 22:49 local.properties
   -rw-rw-r--. 1 wagner wagner  890 jan  5 23:17 MyApplication.iml
   -rw-rw-r--. 1 wagner wagner   15 jan  5 22:49 settings.gradle
   #+end_example


   #+NAME estrut proj criado no Android Studio                     
   #+BEGIN_SRC shell :session s1 :results output :exports both
      #starts code
      cd $ANDROID_STUDIO_PROJECTS_DIR/MyApplication
      ls -l app
   #+END_SRC

   #+RESULTS:
   : 
   : [wagner@Unknown MyApplication]$ total 44
   : -rw-rw-r--. 1 wagner wagner 23291 jan  9 23:14 app.iml
   : drwxrwxr-x. 7 wagner wagner  4096 jan  9 22:53 build
   : -rw-rw-r--. 1 wagner wagner  1082 jan  5 22:49 build.gradle
   : drwxrwxr-x. 2 wagner wagner  4096 jan  5 22:49 libs
   : -rw-rw-r--. 1 wagner wagner   751 jan  5 22:49 proguard-rules.pro
   : drwxrwxr-x. 7 wagner wagner  4096 jan  5 22:49 src
   

  Mas o que que È esse --targets? Pra ver dÍ esse comando abaixo

  #+NAME: list targets
  #+BEGIN_SRC sh
  #!/bin/bash
  android list targets
  #+END_SRC

  #+NAME: list targets
  #+BEGIN_SRC shell :exports both
  ./list_targets.sh
  #+END_SRC



   
